---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupHadFailedElementsWhileUpdating
source: html/47c8e840-e2ae-7366-9c97-b9616b3cd7ba.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupHadFailedElementsWhileUpdating Property

Group members failed while updating group.

## Syntax (C#)
```csharp
public static FailureDefinitionId GroupHadFailedElementsWhileUpdating { get; }
```